SPedt/src/Documents/ЗакрытиеОшибокОбмена/ЗакрытиеОшибокОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакрытиеОшибокОбмена</name>
  <registerRecords>AccumulationRegister.Обмен100СПрн_Ошибки</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ошибки</name>
    <attributes>
      <name>ТипОбмена</name>
      <type>
        <types>EnumRef.ТипыОбменов100сп</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DefinedType.ПартияДляОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаВПартии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Мегаордер</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>Сообщение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНеИсправленных</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SPedt/src/AccumulationRegisters/Обмен100СПрн_Ошибки/Обмен100СПрн_Ошибки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Обмен100СПрн_Ошибки</name>
  <resources>
    <name>КоличествоНеИсправленных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПунктВыдачиНаСтикере</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктВыдачиНовый</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>типОбмена</name>
    <type>
      <types>EnumRef.ТипыОбменов100сп</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПартияДляОбмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтрокаВПартии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Мегаордер</name>
    <type>
      <types>CatalogRef.Мегаордера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СообщениеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SPedt/src/Documents/ЗакрытиеОшибокОбмена/ObjectModule.bsl
Процедура ЗаполнитьОшибками(ВерхняяГраницаОшибки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Обмен100СПрн_ОшибкиОстатки.типОбмена 						КАК типОбмена,
		|	Обмен100СПрн_ОшибкиОстатки.Партия 							КАК Партия,
		|	Обмен100СПрн_ОшибкиОстатки.СтрокаВПартии 					КАК СтрокаВПартии,
		|	Обмен100СПрн_ОшибкиОстатки.Мегаордер 						КАК Мегаордер,
		|	Обмен100СПрн_ОшибкиОстатки.СообщениеОшибки 					КАК Сообщение,
		|	Обмен100СПрн_ОшибкиОстатки.КоличествоНеИсправленныхОстаток 	КАК КоличествоНеИсправленных
		|ИЗ
		|	РегистрНакопления.Обмен100СПрн_Ошибки.Остатки(&НаДату, ) КАК Обмен100СПрн_ОшибкиОстатки";
	Запрос.Параметры.Вставить("НаДату",?(ЗначениеЗаполнено(ВерхняяГраницаОшибки),ВерхняяГраницаОшибки,ТекущаяДата()));
	РезультатЗапроса = Запрос.Выполнить();

	Ошибки.Загрузить(РезультатЗапроса.Выгрузить());
КонецПроцедуры	

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	#Область ПравильноеПроведение
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	Документы.ЗакрытиеОшибокОбмена.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ДополнительныеСвойства.Вставить("ЭтоНовый",ЭтоНовый());
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	СтоСПОбмен_Общий.ОтразитьСтоСПОбмен_РН_Ошибки(ДополнительныеСвойства, Движения, Отказ);
	
	#КонецОбласти
	
КонецПроцедуры
